In [2]:
import sqlite3

# Creating a DB

In [2]:
# Create a connection (db)
conn= sqlite3.connect("Example2.db")

In [3]:
# Create a cursor ( to allow you to execute query in that db)
cur = conn.cursor()

In [4]:
# Create a table
cur.execute("CREATE TABLE CUSTOMER (NAME TEXT, LAST_NAME TEXT, INCOME REAL)")

In [7]:
#Insert a row into table
cur.execute("INSERT INTO CUSTOMER VALUES('SUJEET' , 'SRIVASTAVA', '4343423232134')")

In [8]:
#Save results
conn.commit()

# Connect to an existing DB

In [3]:
conn= sqlite3.connect("Example2.db")

curr= conn.cursor()

In [4]:
curr.execute("SELECT * FROM CUSTOMER")
curr.fetchone() # Fetchall() for all rows

('SUJEET', 'SRIVASTAVA', 4343423232134.0)

In [5]:
for row in curr.execute("SELECT * FROM CUSTOMER"):
    print(row)

('SUJEET', 'SRIVASTAVA', 4343423232134.0)

# Add Several Rows

In [6]:
customer_list=[
    ("Sri","Ambati",3000),
    ("Sandeep","Sai",4040),
    ("Anup","Rai",123)
]

In [7]:
curr.executemany("INSERT INTO CUSTOMER VALUES (?,?,?)",customer_list)

In [8]:
for row in curr.execute("SELECT * FROM CUSTOMER"):
    print(row)

('SUJEET', 'SRIVASTAVA', 4343423232134.0)
('Sri', 'Ambati', 3000.0)
('Sandeep', 'Sai', 4040.0)
('Anup', 'Rai', 123.0)

In [11]:
conn.commit()

# Running Queries

In [12]:
conn.close()

In [13]:
curr.executemany("INSERT INTO CUSTOMER VALUES (?,?,?)",customer_list)

ProgrammingError: Cannot operate on a closed database.

In [14]:
conn= sqlite3.connect("Example2.db")

curr= conn.cursor()

In [15]:
curr.execute("SELECT * FROM CUSTOMER WHERE NAME= 'SUJEET'")
curr.fetchall()

[('SUJEET', 'SRIVASTAVA', 4343423232134.0)]

In [16]:
curr.execute("SELECT * FROM CUSTOMER order by last_name")
curr.fetchall()

[('Sri', 'Ambati', 3000.0),
 ('Anup', 'Rai', 123.0),
 ('SUJEET', 'SRIVASTAVA', 4343423232134.0),
 ('Sandeep', 'Sai', 4040.0)]

In [17]:
conn.close()

# Pandas with SQLite

In [18]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore")

In [19]:
conn= sqlite3.connect("Example2.db")
cur= conn.cursor()

In [20]:
cur.execute("SELECT * FROM CUSTOMER")
cur.fetchall()

[('SUJEET', 'SRIVASTAVA', 4343423232134.0),
 ('Sri', 'Ambati', 3000.0),
 ('Sandeep', 'Sai', 4040.0),
 ('Anup', 'Rai', 123.0)]

In [21]:
# Creating Dataframe from sql query
df= pd.read_sql_query("SELECT * FROM CUSTOMER",conn)
df

      NAME   LAST_NAME        INCOME
0   SUJEET  SRIVASTAVA  4.343423e+12
1      Sri      Ambati  3.000000e+03
2  Sandeep         Sai  4.040000e+03
3     Anup         Rai  1.230000e+02

In [22]:
data = pd.read_sql("SELECT * FROM CUSTOMER",conn)

In [23]:
data

      NAME   LAST_NAME        INCOME
0   SUJEET  SRIVASTAVA  4.343423e+12
1      Sri      Ambati  3.000000e+03
2  Sandeep         Sai  4.040000e+03
3     Anup         Rai  1.230000e+02

In [25]:
import os
path=os.getcwd()

In [26]:
sample_df= pd.read_csv(path+'\\Session+1+Files\\sample.csv')
sample_df

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

# Uploading Pandas DF to SQL

In [27]:
sample_df

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [28]:
sample_df.to_sql("sample_table",conn, if_exists="replace",index=False)

In [30]:
pd.read_sql("select * from sample_table",conn)

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

# Function to get all table info

In [31]:
conn= sqlite3.connect("Example2.db")
cur= conn.cursor()

In [35]:
def table_info(conn,cur):
    """
    prints out all columns for every table in the DB
    """
    tables = cur.execute("select name from sqlite_master WHERE type='table';").fetchall()
    for table_name in tables:
        table_name= table_name[0]
        table= pd.read_sql_query("SELECT * FROM {} limit 0 ".format(table_name), conn)
        print(table_name)
        for col in table.columns:
            print("\t"+col)
            print()

In [36]:
table_info(conn,cur)

CUSTOMER
	NAME

	LAST_NAME

	INCOME

sample_table
	Name

	Age

# Extracting Table Schema

In [37]:
cur.execute("PRAGMA table_info('customer')").fetchall()

[(0, 'NAME', 'TEXT', 0, None, 0),
 (1, 'LAST_NAME', 'TEXT', 0, None, 0),
 (2, 'INCOME', 'REAL', 0, None, 0)]

Every row includes:

- Index of the column
- Column Name
- Data type
- Whether or not the column can be NULL
- The default value for the column
- The primary key in the result is 0 for columns that are not the primary key